app/controllers/line_items_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "line_items" ("created_at", "updated_at", "product_id", "cart_id") VALUES (?, ?, ?, ?)  [["created_at", "2017-06-12 17:53:58.586485"], ["updated_at", "2017-06-12 17:53:58.586485"], ["product_id", 4], ["cart_id", 27]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = ?  [["quantity", 2], ["updated_at", "2017-06-12 17:54:05.835633"], ["id", 27]]
---
  def create

    product = Product.find(params[:product_id])
    @line_item = @cart.add_item(product.id)
    # @line_item = LineItem.new({product: product, cart: @cart})

    respond_to do |format|
      if @line_item.save