app/controllers/orders_controller.rb

  def new
    if @cart.line_items.empty?
---
SELECT  1 AS one FROM "line_items" WHERE "line_items"."cart_id" = ? LIMIT ?  [["cart_id", 28], ["LIMIT", 1]]
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = ?  [["cart_id", 28]]

  def create
    @order = Order.new(order_params)
    @order.add_items_from_cart(@cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])
---
INSERT INTO "orders" ("name", "address", "email", "pay_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Nayak"], ["address", "N"], ["email", "nayakj9@gmail.com"], ["pay_type", "Check"], ["created_at", "2017-06-12 17:54:31.319505"], ["updated_at", "2017-06-12 17:54:31.319505"]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 28]]

  def update
    respond_to do |format|
      if @order.update(order_params)
---
UPDATE "orders" SET "name" = ?, "address" = ?, "email" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["name", "Naya"], ["address", "N"], ["email", "N"], ["updated_at", "2017-06-15 06:29:23.155507"], ["id", 4]]