app/controllers/products_controller.rb

INSERT INTO "products" ("name", "description", "image", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "a"], ["description", "a"], ["image", "1.jpg"], ["price", 1.0], ["created_at", "2017-06-15 23:29:48.204116"], ["updated_at", "2017-06-15 23:29:48.204116"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save