app/controllers/shopper_controller.rb

SELECT "products".* FROM "products" WHERE (name like '%thrones%' OR price like '%thrones%' OR description like '%thrones%') ORDER BY "products"."name" ASC, "products"."description" ASC, "products"."price" ASC
SELECT "products".* FROM "products" ORDER BY "products"."name" ASC
---
  def index
  	if params[:search]
  		query = "%"+params[:search]+"%"
  		@products = Product.where("name like ? OR price like ? OR description like ?", query, query, query).order(:name, :description, :price)
  	else
  		@products = Product.order(:name)