app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)

  def destroy
    if User.count > 1
      @user = User.find(params[:id])
      @user.destroy
---
SELECT COUNT(*) FROM "users"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]